# Python Test - 1
<hr>

### Question 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('dataset-1.csv')
df.head()

   id_1  id_2  route   moto    car     rv   bus  truck
0   829   827      1   2.05   4.14   4.14  10.1   15.2
1   829   821      4   6.63  13.26  13.26  32.4   48.5
2   829   804      7  14.41  28.92  28.92  64.7   97.0
3   829   822      6   5.90  11.81  11.81  28.8   43.2
4   829   826      9   2.87   5.81   5.81  14.2   21.2

In [3]:
df.isnull().sum()

id_1     0
id_2     0
route    0
moto     0
car      0
rv       0
bus      0
truck    0
dtype: int64

In [4]:
pd.DataFrame(df)

     id_1  id_2  route   moto    car     rv   bus  truck
0     829   827      1   2.05   4.14   4.14  10.1   15.2
1     829   821      4   6.63  13.26  13.26  32.4   48.5
2     829   804      7  14.41  28.92  28.92  64.7   97.0
3     829   822      6   5.90  11.81  11.81  28.8   43.2
4     829   826      9   2.87   5.81   5.81  14.2   21.2
..    ...   ...    ...    ...    ...    ...   ...    ...
336   803   802      3   1.70   3.40   3.40   6.9   10.3
337   803   805      4   3.00   6.00   6.00  12.0   17.9
338   803   825      3  11.59  23.28  23.28  50.1   75.2
339   803   806      9   3.80   7.70   7.70  15.3   23.0
340   803   830      1  16.18  32.47  32.47  72.6  108.8

[341 rows x 8 columns]

In [5]:
def generate_car_matrix(df):
    df = df.pivot_table(index='id_1', columns='id_2', values='car')
    
    return df

In [6]:
df_new = generate_car_matrix(df)


print(df_new)

id_2    801    802    803    804    805    806    807    808    809    821  \
id_1
801     NaN   2.80   6.00   7.70  11.70  13.40  16.90  19.60  21.00  23.52
802    2.80    NaN   3.40   5.20   9.20  10.90  14.30  17.10  18.50  20.92
803    6.00   3.40    NaN   2.00   6.00   7.70  11.10  13.90  15.30  17.72
804    7.70   5.20   2.00    NaN   4.40   6.10   9.50  12.30  13.70  16.12
805   11.70   9.20   6.00   4.40    NaN   2.00   5.40   8.20   9.60  12.02
806   13.40  10.90   7.70   6.10   2.00    NaN   3.80   6.60   8.00  10.42
807   16.90  14.30  11.10   9.50   5.40   3.80    NaN   2.90   4.30   6.82
808   19.60  17.10  13.90  12.30   8.20   6.60   2.90    NaN   1.70   4.12
809   21.00  18.50  15.30  13.70   9.60   8.00   4.30   1.70    NaN   2.92
821   23.52  20.92  17.72  16.12  12.02  10.42   6.82   4.12   2.92    NaN
822   24.67  22.07  18.87  17.27  13.17  11.57   7.97   5.27   4.07   1.80
823   26.53  23.93  20.73  19.13  15.03  13.43   9.83   7.13   5.93   3.67
824   27.92  25.32  22.12  20.52  16.42   7.80  11.22   8.52   7.32   5.06
825   29.08  26.48  23.28  21.68  17.58  15.98  12.38   9.68   8.48   6.22
826   30.87  28.27  25.07  23.47  19.37  17.77  14.17  11.47  10.27   8.01
827   32.53  29.93  26.73  25.13  21.03  19.43  15.83  13.13  11.93   9.43
829   36.32  33.72  30.52  28.92  24.82  23.22  19.62  16.92  15.72  13.26
830   38.27  35.67  32.47  30.87  26.77  25.17  21.57  18.87  17.67  15.17
831   39.24  36.64  33.44  31.84  27.74  26.14  22.54  19.84  18.64  16.15

id_2    822    823    824    825    826    827    829    830    831
id_1
801   24.67  26.53  27.92  29.08  30.87  32.53  36.32  38.27  39.24
802   22.07  23.93  25.32  26.48  28.27  29.93  33.72  35.67  36.64
803   18.87  20.73  22.12  23.28  25.07  26.73  30.52  32.47  33.44
804   17.27  19.13  20.52  21.68  23.47  25.13  28.92  30.87  31.84
805   13.17  15.03  16.42  17.58  19.37  21.03  24.82  26.77  27.74
806   11.57  13.43  14.82  15.98  17.77  19.43  23.22  25.17  26.14
807    7.97   9.83  11.22  12.38  14.17  15.83  19.62  21.57  22.54
808    5.27   7.13   8.52   9.68  11.47  13.13  16.92  18.87  19.84
809    4.07   5.93   7.32   8.48  10.27  11.93  15.72  17.67  18.64
821    1.80   3.67   5.06   6.22   8.01   9.43  13.26  15.17  16.15
822     NaN   2.21   3.60   4.76   6.55   8.00  11.81  13.74  14.68
823    2.21    NaN   1.79   2.94   4.74   6.15  10.00  11.89  12.87
824    3.60   1.79    NaN   1.71   3.50   4.92   8.77  10.66  11.64
825    4.76   2.94   1.71    NaN   2.20   3.65   7.46   9.35  10.33
826    6.55   4.74   3.50   2.20    NaN   2.05   5.81   7.71   8.69
827    8.00   6.15   4.92   3.65   2.05    NaN   4.14   6.06   7.04
829   11.81  10.00  21.40   7.46   5.81   4.14    NaN   2.38   3.36
830   13.74  11.89  10.66    NaN   7.71   6.06   2.38    NaN   1.39
831   14.68  12.87  11.64  10.33   8.69   7.04   3.36   1.39    NaN

In [7]:
df_new = df_new.fillna(0)

In [8]:
df_new.head()

id_2,801,802,803,804,805,806,807,808,809,821,822,823,824,825,826,827,829,830,831
id_1,,,,,,,,,,,,,,,,,,,
801,0.0,2.8,6.0,7.7,11.7,13.4,16.9,19.6,21.0,23.52,24.67,26.53,27.92,29.08,30.87,32.53,36.32,38.27,39.24
802,2.8,0.0,3.4,5.2,9.2,10.9,14.3,17.1,18.5,20.92,22.07,23.93,25.32,26.48,28.27,29.93,33.72,35.67,36.64
803,6.0,3.4,0.0,2.0,6.0,7.7,11.1,13.9,15.3,17.72,18.87,20.73,22.12,23.28,25.07,26.73,30.52,32.47,33.44
804,7.7,5.2,2.0,0.0,4.4,6.1,9.5,12.3,13.7,16.12,17.27,19.13,20.52,21.68,23.47,25.13,28.92,30.87,31.84
805,11.7,9.2,6.0,4.4,0.0,2.0,5.4,8.2,9.6,12.02,13.17,15.03,16.42,17.58,19.37,21.03,24.82,26.77,27.74

### Question 2
<hr>

In [9]:
data = pd.read_csv('dataset-1.csv')
data.head()

   id_1  id_2  route   moto    car     rv   bus  truck
0   829   827      1   2.05   4.14   4.14  10.1   15.2
1   829   821      4   6.63  13.26  13.26  32.4   48.5
2   829   804      7  14.41  28.92  28.92  64.7   97.0
3   829   822      6   5.90  11.81  11.81  28.8   43.2
4   829   826      9   2.87   5.81   5.81  14.2   21.2

In [10]:
pd.DataFrame(data)

     id_1  id_2  route   moto    car     rv   bus  truck
0     829   827      1   2.05   4.14   4.14  10.1   15.2
1     829   821      4   6.63  13.26  13.26  32.4   48.5
2     829   804      7  14.41  28.92  28.92  64.7   97.0
3     829   822      6   5.90  11.81  11.81  28.8   43.2
4     829   826      9   2.87   5.81   5.81  14.2   21.2
..    ...   ...    ...    ...    ...    ...   ...    ...
336   803   802      3   1.70   3.40   3.40   6.9   10.3
337   803   805      4   3.00   6.00   6.00  12.0   17.9
338   803   825      3  11.59  23.28  23.28  50.1   75.2
339   803   806      9   3.80   7.70   7.70  15.3   23.0
340   803   830      1  16.18  32.47  32.47  72.6  108.8

[341 rows x 8 columns]

In [11]:
def get_type_count(data):
    data['car_type'] = data['car'].apply(lambda x:'Low' if x <=15 else 'Medium' if x<=25 else 'High')

#Finding type count 
    count_types=data['car_type'].value_counts().to_dict()

#Sorting the new dict

    count_types_sorted = dict(sorted(count_types.items())) 
    
     
    return count_types_sorted

In [12]:
count_types= get_type_count(data)


print(count_types)

{'High': 56, 'Low': 196, 'Medium': 89}

### Question 3
<hr>

In [13]:
def get_bus_indexes(data):
    
#To find mean of bus data
    mean = data['bus'].mean()
    
#Findind the indices

    bus_indexes = data[data['bus'].apply(lambda x: x > 2 * mean)].index.tolist()
    
#Sorting the data in asc 
    
    sorted_bus_indexes=bus_indexes.sort()
    return sorted_bus_indexes

In [14]:
bus_indexes = get_bus_indexes(data)

print(bus_indexes)

None

### Question 4
<hr>

In [15]:
def filter_routes(data):
#Calculate average truck value for each route
    avg_truck_per_route = df.groupby('route')['truck'].mean()

#Filter routes with average truck value greater than 7
    filtered_routes = avg_truck_per_route[avg_truck_per_route > 7]

#Sorting the data 
    sorted_routes = filtered_routes.sort_values()
    return sorted_routes

In [16]:
routes = filter_routes(data)

print(routes)

route
10    41.400000
2     41.403125
5     43.327778
8     46.128571
6     47.952500
1     49.164103
3     50.075000
4     51.096774
7     52.525862
9     54.531429
Name: truck, dtype: float64

### Question 5
<hr>

In [17]:
def multiply_matrix(df_new):
    data5 = df_new.applymap(lambda x: round(x * (0.75 if x > 20 else 1.25), 1))


    return data5

In [18]:
multiplied_matrix = multiply_matrix(df_new)

print(multiplied_matrix)

id_2   801   802   803   804   805   806   807   808   809   821   822   823  \
id_1
801    0.0   3.5   7.5   9.6  14.6  16.8  21.1  24.5  15.8  17.6  18.5  19.9
802    3.5   0.0   4.2   6.5  11.5  13.6  17.9  21.4  23.1  15.7  16.6  17.9
803    7.5   4.2   0.0   2.5   7.5   9.6  13.9  17.4  19.1  22.1  23.6  15.5
804    9.6   6.5   2.5   0.0   5.5   7.6  11.9  15.4  17.1  20.2  21.6  23.9
805   14.6  11.5   7.5   5.5   0.0   2.5   6.8  10.2  12.0  15.0  16.5  18.8
806   16.8  13.6   9.6   7.6   2.5   0.0   4.8   8.2  10.0  13.0  14.5  16.8
807   21.1  17.9  13.9  11.9   6.8   4.8   0.0   3.6   5.4   8.5  10.0  12.3
808   24.5  21.4  17.4  15.4  10.2   8.2   3.6   0.0   2.1   5.2   6.6   8.9
809   15.8  23.1  19.1  17.1  12.0  10.0   5.4   2.1   0.0   3.6   5.1   7.4
821   17.6  15.7  22.1  20.2  15.0  13.0   8.5   5.2   3.6   0.0   2.2   4.6
822   18.5  16.6  23.6  21.6  16.5  14.5  10.0   6.6   5.1   2.2   0.0   2.8
823   19.9  17.9  15.5  23.9  18.8  16.8  12.3   8.9   7.4   4.6   2.8   0.0
824   20.9  19.0  16.6  15.4  20.5   9.8  14.0  10.6   9.2   6.3   4.5   2.2
825   21.8  19.9  17.5  16.3  22.0  20.0  15.5  12.1  10.6   7.8   5.9   3.7
826   23.2  21.2  18.8  17.6  24.2  22.2  17.7  14.3  12.8  10.0   8.2   5.9
827   24.4  22.4  20.0  18.8  15.8  24.3  19.8  16.4  14.9  11.8  10.0   7.7
829   27.2  25.3  22.9  21.7  18.6  17.4  24.5  21.2  19.7  16.6  14.8  12.5
830   28.7  26.8  24.4  23.2  20.1  18.9  16.2  23.6  22.1  19.0  17.2  14.9
831   29.4  27.5  25.1  23.9  20.8  19.6  16.9  24.8  23.3  20.2  18.4  16.1

id_2   824   825   826   827   829   830   831
id_1
801   20.9  21.8  23.2  24.4  27.2  28.7  29.4
802   19.0  19.9  21.2  22.4  25.3  26.8  27.5
803   16.6  17.5  18.8  20.0  22.9  24.4  25.1
804   15.4  16.3  17.6  18.8  21.7  23.2  23.9
805   20.5  22.0  24.2  15.8  18.6  20.1  20.8
806   18.5  20.0  22.2  24.3  17.4  18.9  19.6
807   14.0  15.5  17.7  19.8  24.5  16.2  16.9
808   10.6  12.1  14.3  16.4  21.2  23.6  24.8
809    9.2  10.6  12.8  14.9  19.7  22.1  23.3
821    6.3   7.8  10.0  11.8  16.6  19.0  20.2
822    4.5   5.9   8.2  10.0  14.8  17.2  18.4
823    2.2   3.7   5.9   7.7  12.5  14.9  16.1
824    0.0   2.1   4.4   6.2  11.0  13.3  14.6
825    2.1   0.0   2.8   4.6   9.3  11.7  12.9
826    4.4   2.8   0.0   2.6   7.3   9.6  10.9
827    6.2   4.6   2.6   0.0   5.2   7.6   8.8
829   16.0   9.3   7.3   5.2   0.0   3.0   4.2
830   13.3   0.0   9.6   7.6   3.0   0.0   1.7
831   14.6  12.9  10.9   8.8   4.2   1.7   0.0

### Question 6

* The concept was completely new to me and I had to do my research before doing it. I had a clear idea about date,time function of pandas but I still tried and I guess I will figure it out as soon as I start doing more of this questions.

In [19]:
data6 = pd.read_csv('dataset-2.csv')
data6.head()

,id,name,id_2,startDay,startTime,endDay,endTime,able2Hov2,able2Hov3,able3Hov2,able3Hov3,able5Hov2,able5Hov3,able4Hov2,able4Hov3
0,1040000,Montgomery,-1,Monday,05:00:00,Wednesday,10:00:00,3.0,3.0,-1.0,-1,3,3,3,3
1,1040010,Black,-1,Monday,10:00:00,Friday,15:00:00,6.0,6.0,-1.0,-1,6,6,6,6
2,1040020,Emerald,-1,Thursday,15:00:00,Friday,19:00:00,3.0,3.0,-1.0,-1,3,3,3,3
3,1040030,Foley,-1,Monday,19:00:00,Friday,23:59:59,6.0,6.0,-1.0,-1,6,6,6,6
4,1050000,Whittier,1050001,Saturday,00:00:00,Sunday,23:59:59,6.0,6.0,NaN,-1,6,6,6,6

## Python Task 2
<hr>

### Question 1

In [21]:
task2 = pd.read_csv('dataset-2.csv')

task2.head()

,id,name,id_2,startDay,startTime,endDay,endTime,able2Hov2,able2Hov3,able3Hov2,able3Hov3,able5Hov2,able5Hov3,able4Hov2,able4Hov3
0,1040000,Montgomery,-1,Monday,05:00:00,Wednesday,10:00:00,3.0,3.0,-1.0,-1,3,3,3,3
1,1040010,Black,-1,Monday,10:00:00,Friday,15:00:00,6.0,6.0,-1.0,-1,6,6,6,6
2,1040020,Emerald,-1,Thursday,15:00:00,Friday,19:00:00,3.0,3.0,-1.0,-1,3,3,3,3
3,1040030,Foley,-1,Monday,19:00:00,Friday,23:59:59,6.0,6.0,-1.0,-1,6,6,6,6
4,1050000,Whittier,1050001,Saturday,00:00:00,Sunday,23:59:59,6.0,6.0,NaN,-1,6,6,6,6

In [22]:
task2.isnull().sum()

id              0
name            0
id_2            0
startDay        0
startTime       0
endDay          0
endTime         0
able2Hov2    1806
able2Hov3    1805
able3Hov2    1805
able3Hov3       0
able5Hov2       0
able5Hov3       0
able4Hov2       0
able4Hov3       0
dtype: int64

In [23]:
task2.shape

(39514, 15)

In [31]:
task2['able2Hov3'].value_counts()

6.0     13532
11.0    10175
3.0      7219
8.0      5427
5.0      1356
Name: able2Hov3, dtype: int64

In [32]:
task2['able2Hov2'].value_counts()

6.0     15337
11.0    11531
3.0      5413
8.0      4071
5.0      1356
Name: able2Hov2, dtype: int64

In [34]:
task2['able3Hov2'].value_counts()

-1.0    20751
 4.0    15602
 5.0     1356
Name: able3Hov2, dtype: int64